<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\Alignment;


class AlignmentSeeder extends Seeder {
    public function run() {
        $alignments = [
            ['name' => 'Принциповий-добрий','description' => 'Особистість, що дотримується чітких правил і завжди прагне допомогти іншим. Вона слідує законам і відстоює справедливість, ставлячи загальне благо понад усе.'],
            ['name' => 'Принциповий',       'description' => 'Людина, яка вірить у порядок та чіткі правила, незалежно від добрих чи злих намірів. Вона неохоче порушує закон, діючи згідно з певними кодексами чи принципами.'],
            ['name' => 'Принциповий-злий',  'description' => 'Дотримується законів, але прагне лише особистої вигоди або влади. Така особистість може використовувати правила для власної вигоди, навіть на шкоду іншим.'],
            ['name' => 'Добрий',            'description' => 'Орієнтований на допомогу іншим, навіть якщо це суперечить його інтересам. Ця особистість завжди прагне зробити світ кращим, співчутлива та великодушна.'],
            ['name' => 'Нейтральний',       'description' => 'Збалансована особистість, яка не схильна до крайнощів. Вона діє з власних переконань, не підкоряючись чітко добрим чи злим намірам, дотримуючись нейтралітету.'],
            ['name' => 'Злий',              'description' => 'Прагне досягти своєї мети будь-якими способами, нехтуючи чужими інтересами. Зазвичай діє заради особистої вигоди і не боїться завдати шкоди іншим.'],
            ['name' => 'Хаотичний-добрий',  'description' => 'Цінує свободу та незалежність, допомагає іншим за власним вибором, часто йдучи проти усталених законів і порядку заради добрих справ.'],
            ['name' => 'Хаотичний',         'description' => 'Людина, що дотримується свободи дій, не підкоряється законам або обмеженням. Вона діє імпульсивно і покладається на власні моральні переконання.'],
            ['name' => 'Хаотичний-злий',    'description' => 'Ігнорує закони і порядки, діючи безладно і егоїстично. Така особистість часто зневажає інших та руйнує все, що стримує її свободу.'],
        ];


        foreach ($alignments as $alignment) {
            Alignment::create($alignment);
        }
    }
}
