<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\Background;
use App\Models\Proficiency;

class BackgroundSeeder extends Seeder {
    public function run() {
        $backgrounds = [
            [
                'name' => 'Артист',
                'description' => 'Вам подобається виступати на публіці. Ви знаєте, як їх розважити, зачарувати і навіть надихнути. Ваша поезія може чіпати серця слухачів, пробуджувати в них горе чи радість, сміх чи гнів. Ваша музика підбадьорює їх або змушує журитися. Ваші танці захоплюють, а жарти завжди смішні. Чим би ви не займалися, ваше життя тісно повязане з мистецтвом.',
                'proficiencies' => ['Акробатика', 'Виступ'],
            ],
            [
                'name' => 'Беспризорник',
                'description' => 'Ви виросли на вулиці в бідності та самоті, позбавлені батьків. Ніхто не доглядав і не дбав про вас, і вам довелося навчитися робити це самому. Вам доводилося постійно боротися за їжу та стежити за іншими неприкаяними душами, здатними обікрасти вас. Ви спали на горищах і в провулках, мокли під дощем і боролися із хворобами, не отримуючи медичної допомоги чи притулку. Ви вижили, незважаючи на всі труднощі, і зробили це завдяки своїй вправності, силі чи швидкості.',
                'proficiencies' => ['Спритність рук', 'Непомітність'],
            ],
            [
                'name' => 'Благородний',
                'description' => 'Ви знаєте, що таке багатство, влада та привілеї. У вас благородний титул, а ваша сімя володіє землями, збирає податки, і має серйозний політичний вплив. Ви можете бути зніженим аристократом, незнайомим з роботою і незручностями, колишнім торговцем, який тільки-но отримав титул, або позбавленим спадщини негідником з гіпертрофованим почуттям власного права.',
                'proficiencies' => ['Історія', 'Переконання'],
            ],
            [
                'name' => 'Гільдейський ремісник',
                'description' => 'Ви член гільдії ремісників, знавець в якійсь області, повязаний з іншими майстровими. Ви міцно стоїте на ногах у цьому торговому світі, відокремлені своїм талантом і багатством від кайданів феодального ладу. Колись ви вчилися у майстра під опікою гільдії, і ось ви самі стали таким умільцем.',
                'proficiencies' => ['Проникливість', 'Переконання'],
            ],
            [
                'name' => 'Моряк',
                'description' => 'Ви багато років плавали на морському судні. Ви бачили могутні шторми, глибоководних чудовиськ та тих, хто хотів відправити вас на дно. Перше кохання залишилося далеко за горизонтом, і настав час спробувати щось нове.',
                'proficiencies' => ['Атлетика', 'Сприйняття'],
            ],
            [
                'name' => 'Мудрець',
                'description' => 'Ви провели багато років, осягаючи таємниці мультивсесвіту. Ви читали рукописи, вивчали сувої, і спілкувалися з найбільшими експертами в темах, що вас цікавлять. Все це зробило вас знавцем у своїй галузі.',
                'proficiencies' => ['Історія', 'Магія'],
            ],
            [
                'name' => 'Народний герой',
                'description' => 'У вас був низький соціальний стан, але долею було уготовано більше. Жителі вашого рідного села вже вважають вас своїм героєм, але вам призначено битися з тиранами та чудовиськами, що загрожують іншим.',
                'proficiencies' => ['Виживання', 'Твариництво'],
            ],
            [
                'name' => 'Відлюдник',
                'description' => 'Ви значну частину свого життя прожили на самоті — або в закритій громаді, як монастир, або взагалі на самоті. Вдалині від галасливого суспільства ви знайшли тишу, спокій, а можливо, і відповіді на важливі питання.',
                'proficiencies' => ['Медицина', 'Релігія'],
            ],
            [
                'name' => 'Пірат',
                'description' => 'Ви провели молодість серед жахливих піратів, безжальних головорізів, що навчили вас виживати серед акул та дикунів. Ви займалися грабунком у морях, і не одну душу відправили в солону безодню. Ви добре знайомі зі страхом і кровю, і заслужили сумнівну репутацію у багатьох портових містах.',
                'proficiencies' => ['Атлетика', 'Сприйняття'],
            ],
            [
                'name' => 'Злочинець',
                'description' => 'Ви досвідчений злочинець із великим послужним списком. Ви провели багато часу, обертаючись у злочинних колах, і досі маєте звязки із підпільним світом. На відміну від звичайних людей, ви близько познайомилися з вбивствами, злодійством і жорстокістю, що просочують нижчі верстви суспільства. Ви навчилися виживати, нехтуючи правилами та обмеженнями, яким підкоряються інші.',
                'proficiencies' => ['Обман', 'Непомітність'],
            ],
            [
                'name' => 'Прислужник',
                'description' => 'Ви провели своє життя, служачи в храмі, присвяченому якомусь конкретному богу або пантеону богів. Ви посередник між царством небесним і миром живих. Ви робили священні ритуали і приносили жертви для того, щоб моляться могли постати перед лицем богів. Ви не обовязково жрець — здійснення священних обрядів не те саме, що напрямок божественної сили.',
                'proficiencies' => ['Проникливість', 'Релігія'],
            ],
            [
                'name' => 'Солдат',
                'description' => 'Скільки памятаєте, у вашому житті завжди була війна. З молодості ви проходили тренування, вчилися використовувати зброю та зброю, вивчали техніку виживання, включаючи те, як залишатися живим на полі бою. Ви могли бути частиною армії країни чи загону найманців, а може, були місцевим ополченцем під час війни.',
                'proficiencies' => ['Атлетика', 'Залякування'],
            ],
            [
                'name' => 'Чужоземець',
                'description' => 'Ви виросли в глушині, далеко від цивілізації та її благ. Ви бачили міграцію стад, чий розмір був більший за ліс, виживали при температурі, яку городянам і не уявити, і насолоджувалися такою самотою, що на багато миль навколо ви були єдиною мислячою істотою. Дика природа у вашій крові, будь ви кочівником, дослідником, самітником, мисливцем-збирачем або навіть мародером. Навіть у невідомому місці ви знайдете щось, що вам зрозуміло.',
                'proficiencies' => ['Атлетика', 'Виживання'],
            ],
            [
                'name' => 'Шарлатан',
                'description' => 'Ви добре знаєте людей. Ви розумієте, що ними рухає, і можете розпізнати їх найпотаємніші бажання всього через кілька хвилин після початку розмови. Декілька навідних питань, і ось ви вже читаєте їх наче книжки, написані для дітей. Це корисний талант, і ви цілком готові використати його собі на благо.',
                'proficiencies' => ['Спритність рук', 'Обман'],
            ],
        ];
        
        foreach ($backgrounds as $data) {
            $background = Background::create([
                'name' => $data['name'],
                'description' => $data['description'],
            ]);
        
            $proficiencyIds = Proficiency::whereIn('name', $data['proficiencies'])->pluck('id');
            $background->proficiencies()->attach($proficiencyIds);
        }
    }
}
