<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\Characteristic;
use App\Models\Proficiency;
use App\Models\ClassModel;
use App\Models\Ability;
use App\Models\Spell;


class ClassModelSeeder extends Seeder {
    public function run() {
        $classes = [
            [
                'name'          => 'Бард',
                'description'   => 'Неважливо, ким є бард: вченим, скальдом або пройдисвітом; він плете магію зі слів і музики, надихаючи союзників, деморалізуючи противників, маніпулюючи свідомістю, створюючи ілюзії, і навіть зцілюючи рани.',
                'hp_per_level'  => 8,
                'is_magic'      => 1,
                'saving'        => ['Спритність', 'Харизма'],
                'available'     => 3,
                'proficiences'  => ['Історія','Акробатика','Аналіз','Артистичність','Атлетика','Сприйняття','Залякування','Медицина','Непомітність','Обман','Переконливість','Твариництво','Природа','Проникливість','Релігія','Розслідування','Спритність рук'],
                'abilities'     => ['Натхнення барда', 'Пісня відпочинку', 'Джерело натхнення'],
                'spells'        => ['Мала ілюзія','Розплавленний метал','Скорохід','Лікування ран','Влучний удар','Фокуси','Виявлення магії','Навіювання'],
            ],
            [
                'name'          => 'Варвар',
                'description'   => 'Незважаючи на різноманітність, усіх варварів поєднує одне — їхня лють. Неприборканий, незгасний і бездумний гнів. Не просто емоція, їхня лють як лютість загнаного в кут хижака, як безжальний удар урагану, як штормові вали океану. Лють деяких з них випливає зі спілкування з лютими духами тварин. Інші черпають її зі злості на повну біль і страждання на дійсність. Але для кожного варвара лють - це джерело не тільки бойового божевілля, а й неймовірних рефлексів, стійкості, а також неперевершеної сили.',
                'hp_per_level'  => 12,
                'is_magic'      => 0,
                'saving'        => ['Сила', 'Статура'],
                'available'     => 2,
                'proficiences'  => ['Атлетика', 'Сприйняття', 'Твариництво', 'Залякування', 'Природа', 'Виживання'],
                'abilities'     => ['Захист без обладунків', 'Лють', 'Безрозсудна атака'],
                'spells'        => [''],
            ],
            [
                'name'          => 'Воїн',
                'description'   => 'Досвідчений гладіатор бореться на арені і добре знає, як використовувати свої тризуб і мережу, щоб перекинути противника і обійти його, викликаючи тріумфування публіки і одержуючи тактичну перевагу. Меч його противника спалахує блакитним світлом і випромінює блискучу блискавку. Усі ці герої – воїни.',
                'hp_per_level'  => 10,
                'is_magic'      => 0,
                'saving'        => ['Сила', 'Статура'],
                'available'     => 2,
                'proficiences'  => ['Акробатика', 'Атлетика', 'Сприйняття', 'Виживання', 'Залякування', 'Історія', 'Проникливість', 'Твариництво'],
                'abilities'     => ['Друге дихання','Сплеск дій','Додаткова атака'],
                'spells'        => [''],
            ],
            [
                'name'          => 'Чародій',
                'description'   => 'є носіями магії, дарованої їм при народженні їх екзотичного родоводу, якимось потойбічним впливом або впливом невідомих вселенських сил. Ніхто не може навчитися чародійству, як, наприклад, вивчити мову, як ніхто не може навчити, як прожити легендарне життя. Ніхто не може обрати шлях чарівництва, сила сама вибирає носія.',
                'hp_per_level'  => 6,
                'is_magic'      => 1,
                'saving'        => ['Інтелект', 'Мудрість'],
                'available'     => 2,
                'proficiences'  => ['Історія', 'Магія', 'Медицина', 'Проникливість', 'Розслідування', 'Релігія'],
                'abilities'     => ['Магічне відновлення','Магічні традиції'],
                'spells'        => ['Кислотні бризки','Мала ілюзія','Вогняний снаряд','Промінь холоду','Влучний удар','Фокуси','Відьомський снаряд','Щит','Обладунки мага','Виявлення магії','Навіювання','Туманна хмара'],
            ],
            [
                'name'          => 'Друїд',
                'description'   => 'Закликаючи стихії або наслідуючи тварин, друїди втілюють непорушність, пристосованість і гнів природи.',
                'hp_per_level'  => 8,
                'is_magic'      => 1,
                'saving'        => ['Інтелект', 'Мудрість'],
                'available'     => 2,
                'proficiences'  => ['Сприйняття', 'Виживання', 'Магія', 'Медицина', 'Твариництво', 'Природа', 'Проникливість', 'Релігія'],
                'abilities'     => ['Друїдська мова','Дикий вигляд'],
                'spells'        => ['Розплавленний метал','Виявлення хвороб та отрути','Скорохід','Обплутування','Лікування ран','Виявлення магії','Вічний вогонь','Туманна хмара'],
            ],
            [
                'name'          => 'Жрець',
                'description'   => 'Жерці є посередниками між світом смертних та далекими світами богів. Такі ж різні, наскільки боги, яким вони служать, жерці втілюють роботу своїх божеств. На відміну від звичайного проповідника, жрець наділений божественною магією.',
                'hp_per_level'  => 8,
                'is_magic'      => 0,
                'saving'        => ['Мудрість', 'Харизма'],
                'available'     => 2,
                'proficiences'  => ['Історія', 'Медицина', 'Проникливість', 'Релігія', 'Переконливість'],
                'abilities'     => [''],
                'spells'        => ['Догляд за помираючим','Благословління','Виявлення хвороб та отрути','Лікування ран','Виявлення магії','Вічний вогонь'],
            ],
            [
                'name'          => 'Винахідник',
                'description'   => 'найбільші майстри будити магію у звичайних предметах. Вони розглядають магію як складну систему, яку слід розшифрувати та застосовувати у заклинаннях та винаходах. Для спрямування своєї магічної сили вони використовують різноманітні інструменти.',
                'hp_per_level'  => 8,
                'is_magic'      => 0,
                'saving'        => ['Статура', 'Інтелект'],
                'available'     => 2,
                'proficiences'  => ['Сприйняття', 'Історія', 'Спритність рук', 'Магія', 'Медицина', 'Природа', 'Розслідування'],
                'abilities'     => ['Інфузування педмета','Потрібний інструмент'],
                'spells'        => ['Кислотні бризки','Догляд за помираючим','Вогняний снаряд','Розплавленний метал','Скорохід','Лікування ран','Промінь холоду','Фокуси','Виявлення магії','Вічний вогонь'],
            ],
            [
                'name'          => 'Чаклун',
                'description'   => 'шукачі знань, що ховаються в тканині мультивсесвіту. Через договір, укладений з таємничими істотами надприродної сили, чаклуни відкривають собі магічні ефекти, як ледь вловимі, ​​і вражаючі. Чаклуни підживлюють свої сили стародавніми знаннями таких істот як феї, демони, дияволи, карги та чужорідні сутності Далекої Межі.',
                'hp_per_level'  => 8,
                'is_magic'      => 1,
                'saving'        => ['Мудрість', 'Харизма'],
                'available'     => 2,
                'proficiences'  => ['Залякування', 'Історія', 'Магія', 'Обман', 'Природа', 'Розслідування', 'Релігія'],
                'abilities'     => [''],
                'spells'        => ['Кислотні бризки','Мала ілюзія','Вогняний снаряд','Влучний удар','Фокуси','Навіювання'],
            ],
            [
                'name'          => 'Монах',
                'description'   => 'Незалежно від обраної дисципліни, всіх ченців обєднує одне — можливість керувати енергією, що тече у їхніх тілах. Незалежно від того, чи виявляється вона видатними бойовими здібностями, чи трохи помітним посиленням захисту та швидкості, ця енергія впливає на все, що робить чернець.',
                'hp_per_level'  => 8,
                'is_magic'      => 0,
                'saving'        => ['Сила', 'Спритність'],
                'available'     => 2,
                'proficiences'  => ['Акробатика', 'Атлетика', 'Історія', 'Проникливість', 'Релігія', 'Непомітність'],
                'abilities'     => ['Захист без обладунків','Ці','Відбиття снарядів','Відьомський снаряд'],
                'spells'        => [''],
            ],
            [
                'name'          => 'Паладін',
                'description'   => 'Незалежно від походження та місії, паладинів обєднує їхня клятва протистояти силам зла. Принесена перед вівтарем бога і завірена священиком, або ж на священній галявині перед духами природи і феями, або в момент розпачу та горя смерті, присяга паладина — могутній договір. Це джерело сили, яке перетворює побожного воїна на благословенного героя.',
                'hp_per_level'  => 10,
                'is_magic'      => 0,
                'saving'        => ['Мудрість', 'Харизма'],
                'available'     => 2,
                'proficiences'  => ['Атлетика', 'Залякування', 'Медицина', 'Проникливість', 'Релігія', 'Переконливість'],
                'abilities'     => ['Накладання рук','Бойовий стиль','Божественне здоров`я'],
                'spells'        => ['Благословління','Виявлення хвороб та отрути','Лікування ран','Виявлення магії'],
            ],
            [
                'name'          => 'Шахрай',
                'description'   => 'покладаються на майстерність, скритність і вразливі місця ворогів, щоб узяти гору в будь-якій ситуації. Вони мають достатньо вправ для знаходження рішення в будь-якій ситуації, демонструючи винахідливість і гнучкість, які є наріжним каменем будь-якої успішної групи шукачів пригод.',
                'hp_per_level'  => 8,
                'is_magic'      => 0,
                'saving'        => ['Спритність', 'Інтелект'],
                'available'     => 4,
                'proficiences'  => ['Акробатика', 'Атлетика', 'Сприйняття', 'Артистичність', 'Залякування', 'Спритність рук', 'Обман', 'Проникливість', 'Розслідування', 'Непомітність', 'Переконливість'],
                'abilities'     => ['Прихована атака','Злодійський жаргон','Хитра дія'],
                'spells'        => [''],
            ],
            [
                'name'          => 'Слідопит',
                'description'   => 'Вдалині від суєти міст і селищ, за огорожами, які захищають найдальші ферми від жахів дикої природи, серед дерев, що стоїть щільно, бездоріжжя лісів і на просторах неосяжних рівнин слідопити несуть свій нескінченний дозор.',
                'hp_per_level'  => 10,
                'is_magic'      => 0,
                'saving'        => ['Сила', 'Спритність'],
                'available'     => 3,
                'proficiences'  => ['Атлетика', 'Сприйняття', 'Виживання', 'Природа', 'Проникливість', 'Розслідування', 'Непомітність', 'Твариництво'],
                'abilities'     => ['Обраний ворог','Дослідник природи','Первозданна поінформованість',],
                'spells'        => ['Виявлення хвороб та отрути','Скорохід','Обплутування','Лікування ран','Виявлення магії','Туманна хмара'],
            ],
            [
                'name'          => 'Чарівник',
                'description'   => 'адепти вищої магії, що обєднуються за типом своїх заклинань. Спираючись на тонкі плетіння магії, що пронизує всесвіт, чарівники здатні створювати заклинання вибухового вогню, блискучих блискавок, тонкого обману і грубого контролю над свідомістю. і звертає повалених ворогів у зомбі. Їх наймогутніші заклинання можуть перетворювати одну речовину на іншу, викликати метеорити з небес та відкривати портали в інші світи.',
                'hp_per_level'  => 6,
                'is_magic'      => 1,
                'saving'        => ['Статура', 'Харизма'],
                'available'     => 2,
                'proficiences'  => ['Залякування', 'Магія', 'Обман', 'Проникливість', 'Релігія', 'Переконливість'],
                'abilities'     => [''],
                'spells'        => ['Мала ілюзія','Скорохід','Промінь холоду','Влучний удар','Фокуси','Відьомський снаряд','Щит','Обладунки мага','Виявлення магії','Вічний вогонь','Навіювання','Туманна хмара'],
            ],
        ];
        
        foreach ($classes as $classData) {
            $class = ClassModel::create([
                'name' => $classData['name'],
                'description' => $classData['description'],
                'hp_per_level' => $classData['hp_per_level'],
                'is_magic' => $classData['is_magic'],
                'available_proficiency' => $classData['available'],
            ]);

            $savingThrowIds = Characteristic::whereIn('name', $classData['saving'])->pluck('id')->toArray();
            $proficiencyIds = Proficiency::whereIn('name', $classData['proficiences'])->pluck('id')->toArray();

            $class->savingthrows()->attach($savingThrowIds);
            $class->proficiencies()->attach($proficiencyIds);

            if ($classData['abilities'][0] !== '') {
                $abilityIds = Ability::whereIn('name', $classData['abilities'])->pluck('id')->toArray();
                $class->abilities()->attach($abilityIds);
            }

            if ($classData['spells'][0] !== '') {
                $spellIds = Spell::whereIn('name', $classData['spells'])->pluck('id')->toArray();
                $class->spells()->attach($spellIds);
            }
        }
    }
}