<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\ClassModel;


class ClassModelSeeder extends Seeder {
    public function run() {
        $classes = [
            [
                'name'          => 'Бард',
                'description'   => 'Неважливо, ким є бард: вченим, скальдом або пройдисвітом; він плете магію зі слів і музики, надихаючи союзників, деморалізуючи противників, маніпулюючи свідомістю, створюючи ілюзії, і навіть зцілюючи рани.',
                'hp_per_level'  => 8,
                'is_magic'      => 0,
            ],
            [
                'name'          => 'Винахідник',
                'description'   => 'найбільші майстри будити магію у звичайних предметах. Вони розглядають магію як складну систему, яку слід розшифрувати та застосовувати у заклинаннях та винаходах. Для спрямування своєї магічної сили вони використовують різноманітні інструменти.',
                'hp_per_level'  => 8,
                'is_magic'      => 0,
            ],
            [
                'name'          => 'Шахрай',
                'description'   => 'покладаються на майстерність, скритність і вразливі місця ворогів, щоб узяти гору в будь-якій ситуації. Вони мають достатньо вправ для знаходження рішення в будь-якій ситуації, демонструючи винахідливість і гнучкість, які є наріжним каменем будь-якої успішної групи шукачів пригод.',
                'hp_per_level'  => 8,
                'is_magic'      => 0,
            ],
            [
                'name'          => 'Чаклун',
                'description'   => 'шукачі знань, що ховаються в тканині мультивсесвіту. Через договір, укладений з таємничими істотами надприродної сили, чаклуни відкривають собі магічні ефекти, як ледь вловимі, ​​і вражаючі. Чаклуни підживлюють свої сили стародавніми знаннями таких істот як феї, демони, дияволи, карги та чужорідні сутності Далекої Межі.',
                'hp_per_level'  => 8,
                'is_magic'      => 1,
            ],
            [
                'name'          => 'Чарівник',
                'description'   => 'є носіями магії, дарованої їм при народженні їх екзотичного родоводу, якимось потойбічним впливом або впливом невідомих вселенських сил. Ніхто не може навчитися чародійству, як, наприклад, вивчити мову, як ніхто не може навчити, як прожити легендарне життя. Ніхто не може обрати шлях чарівництва, сила сама вибирає носія.',
                'hp_per_level'  => 6,
                'is_magic'      => 1,
            ],
            [
                'name'          => 'Друїд',
                'description'   => 'Закликаючи стихії або наслідуючи тварин, друїди втілюють непорушність, пристосованість і гнів природи.',
                'hp_per_level'  => 8,
                'is_magic'      => 1,
            ],
            [
                'name'          => 'Воїн',
                'description'   => 'Досвідчений гладіатор бореться на арені і добре знає, як використовувати свої тризуб і мережу, щоб перекинути противника і обійти його, викликаючи тріумфування публіки і одержуючи тактичну перевагу. Меч його противника спалахує блакитним світлом і випромінює блискучу блискавку. Усі ці герої – воїни.',
                'hp_per_level'  => 10,
                'is_magic'      => 0,
            ],
        ];

        foreach ($classes as $class) {
            ClassModel::create([
                'name' => $class['name'],
                'description' => $class['description'],
                'hp_per_level' => $class['hp_per_level'],
                'is_magic' => $class['is_magic'],
            ]);
        }
    }
}
