<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\Spell;


class SpellSeeder extends Seeder {
    public function run() {
        $spells = [
            [
                'name'          => 'Кислотні бризки',
                'description'   => 'Ви кидаєте кислотну кульку. Виберіть одну істоту, яку ви бачите в межах дистанції, або дві істоти, які ви бачите в межах дистанції, що знаходяться в межах 5 футів один від одного. Мета повинна досягти успіху в спаскидці Спритності, інакше отримає 1к6 збитків кислотою. Втрата цього заклинання збільшується на 1к6, коли ви досягаєте 5-го рівня (2к6), 11-го рівня (3к6) та 17-го рівня (4к6).',
                'level'         => 0,
            ],
            [
                'name'          => 'Догляд за помираючим',
                'description'   => 'Ви торкаєтеся живої істоти, яка має 0 хітів. Воно стає стабілізованим. Це заклинання не має жодного ефекту на Нежить і Конструктів.',
                'level'         => 0,
            ],
            [
                'name'          => 'Мала ілюзія',
                'description'   => 'Ви створюєте звук або образ предмета в межах дистанції, що існує, поки активне заклинання. Ілюзія також закінчується, якщо ви відпустите її дією або використовуєте це заклинання ще раз.',
                'level'         => 0,
            ],
            [
                'name'          => 'Благословління',
                'description'   => 'Ви благословляєте до трьох істот на свій вибір у межах дистанції. Щоразу, коли до закінчення заклинання мета робить кидок атаки чи спаскидок, вона може кинути к4 і додати число, що випало до результату.',
                'level'         => 1,
            ],
            [
                'name'          => 'Вигняний снаряд',
                'description'   => 'Ви кидаєте потік вогню в істоту чи предмет у межах дистанції. Здійсніть за метою далекобійну атаку заклинанням. При попаданні мета отримує шкоду вогнем 1к10. Горючі предмети, якими потрапило це заклинання, спалахують, якщо їх ніхто не несе і не носить. Втрата цього заклинання збільшується на 1к10, коли ви досягаєте 5-го рівня (2к10), 11-го рівня (3к10), 17-го рівня (4к10).',
                'level'         => 1,
            ],
            [
                'name'          => 'Розплавленний метал',
                'description'   => 'Виберіть рукотворний металевий предмет, такий як металева зброя або комплект важкої або середньої зброї, видимий в межах дистанції. Ви робите його розпеченим до червоного. Всі істоти, які перебувають у фізичному контакті з цим предметом, одержують шкоду вогнем 2к8, коли ви накладаєте це заклинання.',
                'level'         => 2,
            ],
        ];

        foreach ($spells as $spell) {
            Spell::create([
                'name' => $spell['name'],
                'description' => $spell['description'],
                'level' => $spell['level'],
            ]);
        }
    }
}
