<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\Spell;


class SpellSeeder extends Seeder {
    public function run() {
        $spells = [
            [
                'name'          => 'Кислотні бризки',
                'description'   => 'Ви кидаєте кислотну кульку. Виберіть одну істоту, яку ви бачите в межах дистанції, або дві істоти, які ви бачите в межах дистанції, що знаходяться в межах 5 футів один від одного. Мета повинна досягти успіху в спаскидці Спритності, інакше отримає 1к6 збитків кислотою. Втрата цього заклинання збільшується на 1к6, коли ви досягаєте 5-го рівня (2к6), 11-го рівня (3к6) та 17-го рівня (4к6).',
                'level'         => 0,
            ],
            [
                'name'          => 'Догляд за помираючим',
                'description'   => 'Ви торкаєтеся живої істоти, яка має 0 хітів. Воно стає стабілізованим. Це заклинання не має жодного ефекту на Нежить і Конструктів.',
                'level'         => 0,
            ],
            [
                'name'          => 'Мала ілюзія',
                'description'   => 'Ви створюєте звук або образ предмета в межах дистанції, що існує, поки активне заклинання. Ілюзія також закінчується, якщо ви відпустите її дією або використовуєте це заклинання ще раз.',
                'level'         => 0,
            ],
            [
                'name'          => 'Благословління',
                'description'   => 'Ви благословляєте до трьох істот на свій вибір у межах дистанції. Щоразу, коли до закінчення заклинання мета робить кидок атаки чи спаскидок, вона може кинути к4 і додати число, що випало до результату.',
                'level'         => 1,
            ],
            [
                'name'          => 'Вогняний снаряд',
                'description'   => 'Ви кидаєте потік вогню в істоту чи предмет у межах дистанції. Здійсніть за метою далекобійну атаку заклинанням. При попаданні мета отримує шкоду вогнем 1к10. Горючі предмети, якими потрапило це заклинання, спалахують, якщо їх ніхто не несе і не носить. Втрата цього заклинання збільшується на 1к10, коли ви досягаєте 5-го рівня (2к10), 11-го рівня (3к10), 17-го рівня (4к10).',
                'level'         => 1,
            ],
            [
                'name'          => 'Розплавленний метал',
                'description'   => 'Виберіть рукотворний металевий предмет, такий як металева зброя або комплект важкої або середньої зброї, видимий в межах дистанції. Ви робите його розпеченим до червоного. Всі істоти, які перебувають у фізичному контакті з цим предметом, одержують шкоду вогнем 2к8, коли ви накладаєте це заклинання.',
                'level'         => 2,
            ],
            [
                'name'          => 'Виявлення хвороб та отрути',
                'description'   => 'Поки заклинання активно, ви можете відчувати присутність та місцезнаходження отрут, отруйних істот та хвороб у межах 30 футів від себе. Ви також розпізнаєте вид отрути, отруйної істоти чи хвороби.',
                'level'         => 1,
            ],
            [
                'name'          => 'Скорохід',
                'description'   => 'Ви торкаєтесь істоти. Поки заклинання активне, швидкість істоти збільшується на 10 футів.',
                'level'         => 1,
            ],
            [
                'name'          => 'Обплутування',
                'description'   => 'З точки на землі в межах дистанції на площі квадрата з довжиною боку 20 футів виростають чіпкі трави і батоги. Поки заклинання активно, ці рослини перетворюють землю на важкопрохідну місцевість. Істоти, що знаходяться в цій галузі, коли ви накладаєте заклинання, повинні досягти успіху в спаски Сили, інакше вони стануть обплутаними рослинами до закінчення дії заклинання. Плутана рослинами істота може дією здійснювати перевірки Сили проти Сл ваших заклинань. У разі успіху воно звільняється.',
                'level'         => 1,
            ],
            [
                'name'          => 'Лікування ран',
                'description'   => 'Істота, яку ви торкаєтеся, відновлює кількість хітів, що дорівнює 1к8 + ваш модифікатор базової характеристики. Це заклинання не має жодного ефекту на Нежить і Конструктів.',
                'level'         => 1,
            ],
            [
                'name'          => 'Промінь холоду',
                'description'   => 'Холодний синьо-білий промінь спрямовується до суті, що знаходиться в межах дистанції. Здійсніть за метою далекобійну атаку заклинанням. При попаданні вона отримує шкоду холодом 1к8, а швидкість до початку наступного ходу зменшується на 10 футів.',
                'level'         => 0,
            ],
            [
                'name'          => 'Влучний удар',
                'description'   => 'Ви витягуєте руку і вказуєте пальцем на ціль, що знаходиться в межах дистанції. Ваша магія дає коротке розуміння захисту мети. У своєму наступному ході ви здійснюєте з перевагою перший кидок атаки по меті, за умови, що заклинання на той момент не закінчиться.',
                'level'         => 0,
            ],
            [
                'name'          => 'Фокуси',
                'description'   => 'Це заклинання — невеликий магічний трюк, на якому практикуються заклиначі-початківці. Ви створюєте один із наступних магічних ефектів у межах дистанції: Якщо ви накладаєте це заклинання кілька разів, ви можете мати не більше трьох миттєвих ефектів одночасно. Ви можете завершити один з цих ефектів.',
                'level'         => 0,
            ],
            [
                'name'          => 'Відьомський снаряд',
                'description'   => 'Промінь потріскує синюватої енергії спрямовується до суті в межах дистанції, формуючи між вами і метою безперервний дуговий розряд. Здійсніть далекобійну атаку заклинанням по цій суті. При попаданні ціль отримує 1к12 шкоди електрикою, і, поки заклинання активно, ви можете в кожен свій хід дією автоматично завдавати мети 1к12 електрики. Це заклинання закінчується, якщо ви дією зробите щось інше. Заклинання також закінчується, якщо ціль опиниться за межами дистанції заклинання або отримає від вас повне укриття.',
                'level'         => 1,
            ],
            [
                'name'          => 'Щит',
                'description'   => 'Невидимий бар`єр із магічної сили з`являється, захищаючи вас. Ви отримуєте до початку свого наступного ходу бонус +5 до КД, у тому числі й проти атаки, що викликала спрацювання, і ви не отримуєте шкоди від заклинання чарівна стріла',
                'level'         => 1,
            ],
            [
                'name'          => 'Обладунки мага',
                'description'   => 'Ви торкаєтеся приголосної істоти, що не носить обладунок, і на час дії заклинання його огортає захисне магічне поле. Базовий КД істоти дорівнює 13 + його модифікатор Спритності. Заклинання закінчується, якщо ціль надягає обладунок або ви закінчуєте його дією.',
                'level'         => 1,
            ],
            [
                'name'          => 'Виявлення магії',
                'description'   => 'Поки заклинання активно, ви відчуваєте присутність магії близько 30 футів. Якщо ви відчули за рахунок цього заклинання присутність магії, ви можете дією побачити слабку ауру навколо видимої істоти або предмета, що несе на собі магію, а також дізнатися про школу цієї магії, якщо вона є. Заклинання проникає більшу частину бар`єрів, але блокується 1 футом каменю, 1 дюймом звичайного металу, тонким листом свинцю або 3 футами дерева чи землі.',
                'level'         => 1,
            ],
            [
                'name'          => 'Вічний вогонь',
                'description'   => 'З предмета, якого ви торкаєтеся, виходить полум`я, еквівалентне яскравості полум`я факела. Ефект виглядає як звичайне полум`я, але не створює тепла та не використовує кисень. Вічний вогонь можна накрити чи сховати, але не згасити.',
                'level'         => 2,
            ],
            [
                'name'          => 'Навіювання',
                'description'   => 'Ви вселяєте певний курс дій (обмежений однією-двома фразами) суті, видимій у межах дистанції, здатній чути і розуміти вас. Істоти, які не можуть бути зачаровані, мають імунітет до цього ефекту. Навіювання має бути сформоване так, щоб дія звучала розумною. Прохання вдарити себе мечем, кинутися на спис, спалити себе, або якось інакше заподіяти собі шкоду закінчують заклинання.',
                'level'         => 2,
            ],
            [
                'name'          => 'Туманна хмара',
                'description'   => 'Ви створюєте сферу з радіусом 20 футів із туману з центром на точці в межах дистанції. Сфера обходить кути, і її простір — сильно затулена місцевість. Вона існує до закінчення дії заклинання, або поки її не розвіє вітер (зі швидкістю щонайменше 10 миль на годину).',
                'level'         => 1,
            ],
        ];
        
        foreach ($spells as $spell) {
            Spell::create([
                'name' => $spell['name'],
                'description' => $spell['description'],
                'level' => $spell['level'],
            ]);
        }
    }
}