<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\Characteristic;
use App\Models\Weapon;


class WeaponSeeder extends Seeder {
    public function run() {
        $weapons = [
            [
                'name'          => 'Бойовий посох',
                'description'   => 'Довга дерев’яна палиця, яка допомагає відбивати атаки і добре підходить для захисту.',
                'damage'        => 6,
                'cost'          => 200,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Булава',
                'description'   => 'Зброя з важкою головкою на рукояті, що завдає потужних ударів і здатна пробити легкі обладунки. Урон: дроблячий',
                'damage'        => 6,
                'cost'          => 50000,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => '50000',
                'description'   => 'Проста і легка зброя, зазвичай зроблена з дерева, що підходить для ближнього бою. Урон: дроблячий',
                'damage'        => 4,
                'cost'          => 100,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Кинжал',
                'description'   => 'Малий і гострий, легкий для приховування, підходить для швидких і точних атак. Урон: колючий',
                'damage'        => 4,
                'cost'          => 20000,
                'characteristic'=> 'Спритність',
            ],
            [
                'name'          => 'Спис',
                'description'   => 'Зброя з довгим держаком і гострим кінцем, дозволяє тримати супротивника на відстані. Урон: колючий',
                'damage'        => 6,
                'cost'          => 10000,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Легкий молот',
                'description'   => 'Компактний молот, яким зручно завдавати швидких ударів. Часто використовується як метальна зброя. Урон: дроблячий',
                'damage'        => 4,
                'cost'          => 20000,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Метальний спис',
                'description'   => 'Легка версія звичайного списа, розроблена для метання на середню відстань. Урон: колючий',
                'damage'        => 6,
                'cost'          => 500,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Палиця',
                'description'   => 'Проста дерев’яна зброя, яка підходить для самооборони. Легко використовується, навіть без тренувань. Урон: дроблячий',
                'damage'        => 8,
                'cost'          => 200,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Ручна сокира',
                'description'   => 'Невелика сокира для ближнього бою і метання, здатна завдати значної шкоди. Урон: рубаючий',
                'damage'        => 6,
                'cost'          => 50000,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Серп',
                'description'   => 'Інструмент, що використовується як зброя. Має загнуте лезо, підходить для ближніх атак. Урон: ріжучий',
                'damage'        => 4,
                'cost'          => 10000,
                'characteristic'=> 'Спритність',
            ],
            [
                'name'          => 'Арбалет легкий',
                'description'   => 'Менший за розмірами арбалет, який легко заряджається і використовується для стрільби з відстані. Урон: колючий',
                'damage'        => 8,
                'cost'          => 250000,
                'characteristic'=> 'Спритність',
            ],
            [
                'name'          => 'Дротик',
                'description'   => 'Легкий метальний снаряд для точних кидків, зручний для короткої дистанції. Урон: колючий',
                'damage'        => 4,
                'cost'          => 5,
                'characteristic'=> 'Спритність',
            ],
            [
                'name'          => 'Короткий лук',
                'description'   => 'Компактний лук, який дозволяє швидко стріляти на близькій відстані. Урон: колючий',
                'damage'        => 6,
                'cost'          => 250000,
                'characteristic'=> 'Спритність',
            ],
            [
                'name'          => 'Довгий лук',
                'description'   => 'Потужний лук, здатний вражати цілі на великих відстанях. Потребує навичок для використання. Урон: колючий',
                'damage'        => 8,
                'cost'          => 500000,
                'characteristic'=> 'Спритність',
            ],
            [
                'name'          => 'Праща',
                'description'   => 'Проста зброя для метання каменів або інших снарядів на середню відстань. Урон: дроблячий',
                'damage'        => 4,
                'cost'          => 100,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Духова трубка',
                'description'   => 'Зброя для стрільби дротиками, що діє безшумно і підходить для прихованих атак. Урон: колючий',
                'damage'        => 4,
                'cost'          => 100000,
                'characteristic'=> 'Спритність',
            ],
            [
                'name'          => 'Бойова кірка',
                'description'   => 'Інструмент з гострим вістрям, що підходить для пробивання захисту. Урон: ріжучий',
                'damage'        => 8,
                'cost'          => 50000,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Бойовий молот',
                'description'   => 'Важка зброя, що завдає потужних ударів, здатна зруйнувати захист. Урон: дроблячий',
                'damage'        => 8,
                'cost'          => 150000,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Бойова сокира',
                'description'   => 'Потужна дворука сокира, що завдає сильних ударів і легко пробиває броню. Урон: рубаючий',
                'damage'        => 8,
                'cost'          => 100000,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Дворучний меч',
                'description'   => 'Великий меч, що вимагає обох рук для використання і завдає надзвичайно потужних ударів. Урон: ріжучий',
                'damage'        => 12,
                'cost'          => 500000,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Довгий спис',
                'description'   => 'Спис із видовженим держаком, що дає можливість атакувати з безпечної відстані. Урон: колючий',
                'damage'        => 12,
                'cost'          => 100000,
                'characteristic'=> 'Сила',
            ],
            [
                'name'          => 'Батіг',
                'description'   => 'Гнучка зброя для тримання супротивника на відстані, підходить для контролю. Урон: ріжучий',
                'damage'        => 4,
                'cost'          => 20000,
                'characteristic'=> 'Спритність',
            ],
            [
                'name'          => 'Короткий меч',
                'description'   => 'Легкий і швидкий, ідеальний для ближнього бою. Зручно використовувати для швидких і точних ударів. Урон: ріжучий',
                'damage'        => 6,
                'cost'          => 150000,
                'characteristic'=> 'Спритність',
            ],
        ];

        foreach ($weapons as $weapon) {
            $characteristic = Characteristic::where('name', $weapon['characteristic'])->first();
            if ($characteristic) {
                Weapon::create([
                    'name' => $weapon['name'],
                    'description' => $weapon['description'],
                    'damage' => $weapon['damage'],
                    'cost' => $weapon['cost'],

                    'characteristic_id' => $characteristic->id,
                ]);
            }
        }
    }
}
